### 데이터변형 실습

- auto 데이터

In [55]:
import pandas as pd

names = ['mpg',  'cylinders',  'displacement',  'horsepower',  'weight'
       ,  'acceleration',  'model_year',  'origin',  'name']

df = pd.read_csv('data/auto-mpg.data', sep = '\s+', header = None, names = names)
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150.0,3433.0,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140.0,3449.0,10.5,70,1,ford torino

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    398 non-null    object
 4   weight        398 non-null    float64
 5   acceleration  398 non-null    float64
 6   model_year    398 non-null    int64
 7   origin        398 non-null    int64
 8   name          398 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 28.1+ KB

In [57]:
df['horsepower'][df['horsepower'] == '?'] # horsepower 컬럼에서 null 처리해야 하는 값들

32     ?
126    ?
330    ?
336    ?
354    ?
374    ?
Name: horsepower, dtype: object

In [58]:
df.describe()

,mpg,cylinders,displacement,weight,acceleration,model_year,origin
count,398.000000,398.000000,398.000000,398.000000,398.000000,398.000000,398.000000
mean,23.514573,5.454774,193.425879,2970.424623,15.568090,76.010050,1.572864
std,7.815984,1.701004,104.269838,846.841774,2.757689,3.697627,0.802055
min,9.000000,3.000000,68.000000,1613.000000,8.000000,70.000000,1.000000
25%,17.500000,4.000000,104.250000,2223.750000,13.825000,73.000000,1.000000
50%,23.000000,4.000000,148.500000,2803.500000,15.500000,76.000000,1.000000
75%,29.000000,8.000000,262.000000,3608.000000,17.175000,79.000000,2.000000
max,46.600000,8.000000,455.000000,5140.000000,24.800000,82.000000,3.000000

In [59]:
df['horsepower'].unique()

array(['130.0', '165.0', '150.0', '140.0', '198.0', '220.0', '215.0',
       '225.0', '190.0', '170.0', '160.0', '95.00', '97.00', '85.00',
       '88.00', '46.00', '87.00', '90.00', '113.0', '200.0', '210.0',
       '193.0', '?', '100.0', '105.0', '175.0', '153.0', '180.0', '110.0',
       '72.00', '86.00', '70.00', '76.00', '65.00', '69.00', '60.00',
       '80.00', '54.00', '208.0', '155.0', '112.0', '92.00', '145.0',
       '137.0', '158.0', '167.0', '94.00', '107.0', '230.0', '49.00',
       '75.00', '91.00', '122.0', '67.00', '83.00', '78.00', '52.00',
       '61.00', '93.00', '148.0', '129.0', '96.00', '71.00', '98.00',
       '115.0', '53.00', '81.00', '79.00', '120.0', '152.0', '102.0',
       '108.0', '68.00', '58.00', '149.0', '89.00', '63.00', '48.00',
       '66.00', '139.0', '103.0', '125.0', '133.0', '138.0', '135.0',
       '142.0', '77.00', '62.00', '132.0', '84.00', '64.00', '74.00',
       '116.0', '82.00'], dtype=object)

In [60]:
pd.DataFrame(df['horsepower'].value_counts())

       horsepower
150.0          22
90.00          20
88.00          19
110.0          18
100.0          17
...           ...
61.00           1
93.00           1
148.0           1
152.0           1
82.00           1

[94 rows x 1 columns]

In [61]:
import numpy as np
df['horsepower'].replace('?', np.nan, inplace=True)
df['horsepower'].isnull().sum()

6

In [62]:
# horsepower 컬럼에 null 값이 있는 '행'을 제거
df.dropna(subset=['horsepower'], axis=0, inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 392 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           392 non-null    float64
 1   cylinders     392 non-null    int64
 2   displacement  392 non-null    float64
 3   horsepower    392 non-null    object
 4   weight        392 non-null    float64
 5   acceleration  392 non-null    float64
 6   model_year    392 non-null    int64
 7   origin        392 non-null    int64
 8   name          392 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 30.6+ KB

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 392 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           392 non-null    float64
 1   cylinders     392 non-null    int64
 2   displacement  392 non-null    float64
 3   horsepower    392 non-null    object
 4   weight        392 non-null    float64
 5   acceleration  392 non-null    float64
 6   model_year    392 non-null    int64
 7   origin        392 non-null    int64
 8   name          392 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 30.6+ KB

In [64]:
df.isnull().sum().sum()

0

In [65]:
df.reset_index(drop=True, inplace=True)
df.tail()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
387,27.0,4,140.0,86.00,2790.0,15.6,82,1,ford mustang gl
388,44.0,4,97.0,52.00,2130.0,24.6,82,2,vw pickup
389,32.0,4,135.0,84.00,2295.0,11.6,82,1,dodge rampage
390,28.0,4,120.0,79.00,2625.0,18.6,82,1,ford ranger
391,31.0,4,119.0,82.00,2720.0,19.4,82,1,chevy s-10

In [66]:
df['horsepower'] = df['horsepower'].astype('float')
df.describe()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin
count,392.000000,392.000000,392.000000,392.000000,392.000000,392.000000,392.000000,392.000000
mean,23.445918,5.471939,194.411990,104.469388,2977.584184,15.541327,75.979592,1.576531
std,7.805007,1.705783,104.644004,38.491160,849.402560,2.758864,3.683737,0.805518
min,9.000000,3.000000,68.000000,46.000000,1613.000000,8.000000,70.000000,1.000000
25%,17.000000,4.000000,105.000000,75.000000,2225.250000,13.775000,73.000000,1.000000
50%,22.750000,4.000000,151.000000,93.500000,2803.500000,15.500000,76.000000,1.000000
75%,29.000000,8.000000,275.750000,126.000000,3614.750000,17.025000,79.000000,2.000000
max,46.600000,8.000000,455.000000,230.000000,5140.000000,24.800000,82.000000,3.000000

In [67]:
# 데이터 변형: 원하는 데이터 추출 -> 새로운 컬럼
df['name2'] =df['name'].apply(lambda x: x.split()[0])
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,name2
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu,chevrolet
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320,buick
2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite,plymouth
3,16.0,8,304.0,150.0,3433.0,12.0,70,1,amc rebel sst,amc
4,17.0,8,302.0,140.0,3449.0,10.5,70,1,ford torino,ford

In [68]:
df['name2'].unique()

array(['chevrolet', 'buick', 'plymouth', 'amc', 'ford', 'pontiac',
       'dodge', 'toyota', 'datsun', 'volkswagen', 'peugeot', 'audi',
       'saab', 'bmw', 'chevy', 'hi', 'mercury', 'opel', 'fiat',
       'oldsmobile', 'chrysler', 'mazda', 'volvo', 'renault', 'toyouta',
       'maxda', 'honda', 'subaru', 'chevroelt', 'capri', 'vw',
       'mercedes-benz', 'cadillac', 'mercedes', 'vokswagen', 'triumph',
       'nissan'], dtype=object)

In [69]:
# 문자열 내용 수정
df['name2'].replace('toyouta', 'toyota', inplace=True)

In [70]:
df['name2'].replace('chevroelt', 'chevrolet', inplace=True)

In [71]:
df['name2'].replace('maxda', 'mazda', inplace=True)

In [72]:
df['name2'].replace('vokswagen', 'volkswagen', inplace=True)

In [73]:
df['name2'].unique()

array(['chevrolet', 'buick', 'plymouth', 'amc', 'ford', 'pontiac',
       'dodge', 'toyota', 'datsun', 'volkswagen', 'peugeot', 'audi',
       'saab', 'bmw', 'chevy', 'hi', 'mercury', 'opel', 'fiat',
       'oldsmobile', 'chrysler', 'mazda', 'volvo', 'renault', 'honda',
       'subaru', 'capri', 'vw', 'mercedes-benz', 'cadillac', 'mercedes',
       'triumph', 'nissan'], dtype=object)

In [74]:
df['name2'].nunique()

33

In [75]:
pd.get_dummies(df['name2'][:10])

   amc  buick  chevrolet  ford  plymouth  pontiac
0    0      0          1     0         0        0
1    0      1          0     0         0        0
2    0      0          0     0         1        0
3    1      0          0     0         0        0
4    0      0          0     1         0        0
5    0      0          0     1         0        0
6    0      0          1     0         0        0
7    0      0          0     0         1        0
8    0      0          0     0         0        1
9    1      0          0     0         0        0

In [76]:
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,name2
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu,chevrolet
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320,buick
2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite,plymouth
3,16.0,8,304.0,150.0,3433.0,12.0,70,1,amc rebel sst,amc
4,17.0,8,302.0,140.0,3449.0,10.5,70,1,ford torino,ford

In [77]:
onehot_name2 = pd.get_dummies(df['name2']).astype('int64')
onehot_name2

,amc,audi,bmw,buick,cadillac,capri,chevrolet,chevy,chrysler,datsun,...,plymouth,pontiac,renault,saab,subaru,toyota,triumph,volkswagen,volvo,vw
0,0,0,0,0,0,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,0,0,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,0,0,0,0,0,0,0,0,0,0,...,1,0,0,0,0,0,0,0,0,0
3,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
387,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
388,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
389,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
390,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
391,0,0,0,0,0,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0

In [78]:
pd.concat([df, onehot_name2], axis=1)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,name2,...,plymouth,pontiac,renault,saab,subaru,toyota,triumph,volkswagen,volvo,vw
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu,chevrolet,...,0,0,0,0,0,0,0,0,0,0
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320,buick,...,0,0,0,0,0,0,0,0,0,0
2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite,plymouth,...,1,0,0,0,0,0,0,0,0,0
3,16.0,8,304.0,150.0,3433.0,12.0,70,1,amc rebel sst,amc,...,0,0,0,0,0,0,0,0,0,0
4,17.0,8,302.0,140.0,3449.0,10.5,70,1,ford torino,ford,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
387,27.0,4,140.0,86.0,2790.0,15.6,82,1,ford mustang gl,ford,...,0,0,0,0,0,0,0,0,0,0
388,44.0,4,97.0,52.0,2130.0,24.6,82,2,vw pickup,vw,...,0,0,0,0,0,0,0,0,0,1
389,32.0,4,135.0,84.0,2295.0,11.6,82,1,dodge rampage,dodge,...,0,0,0,0,0,0,0,0,0,0
390,28.0,4,120.0,79.0,2625.0,18.6,82,1,ford ranger,ford,...,0,0,0,0,0,0,0,0,0,0
391,31.0,4,119.0,82.0,2720.0,19.4,82,1,chevy s-10,chevy,...,0,0,0,0,0,0,0,0,0,0

In [79]:
df['horsepower'].describe() # 숫자 -> 카테고리: 저출력, 보통출력, 고출력

count    392.000000
mean     104.469388
std       38.491160
min       46.000000
25%       75.000000
50%       93.500000
75%      126.000000
max      230.000000
Name: horsepower, dtype: float64

In [80]:
count, bin_dividers = np.histogram(df['horsepower'], bins=3)
bin_dividers

array([ 46.        , 107.33333333, 168.66666667, 230.        ])

In [81]:
df['hp_bin'] = pd.cut(x=df['horsepower'], bins=bin_dividers, 
                      labels=['저출력','보통출력','고출력'], include_lowest=True)
df['hp_bin'].value_counts()

저출력     257
보통출력    103
고출력      32
Name: hp_bin, dtype: int64

In [82]:
# 참고
age_tmp = pd.Series(np.arange(1,100,3))
age_tmp

0      1
1      4
2      7
3     10
4     13
5     16
6     19
7     22
8     25
9     28
10    31
11    34
12    37
13    40
14    43
15    46
16    49
17    52
18    55
19    58
20    61
21    64
22    67
23    70
24    73
25    76
26    79
27    82
28    85
29    88
30    91
31    94
32    97
dtype: int32

In [83]:
# 구간의 끝값을 포함하는 것이 default -> 끝값을 포함하고 싶지 않으면 right 파라미터에 False 설정 필요
age_bin = pd.cut(x=age_tmp, bins=[1, 31, 61, 97.1], 
       labels=['아이','성인','노인'], include_lowest=True, right=False)

In [84]:
df_tmp = pd.DataFrame({'age': age_tmp, 'age_bin': age_bin})
df_tmp.head()

   age age_bin
0    1      아이
1    4      아이
2    7      아이
3   10      아이
4   13      아이

In [85]:
df_tmp.tail()

    age age_bin
28   85      노인
29   88      노인
30   91      노인
31   94      노인
32   97      노인

In [86]:
df_tmp['age_bin'].apply(lambda x: '아이' if x == '아이' else '아이 아님')

0        아이
1        아이
2        아이
3        아이
4        아이
5        아이
6        아이
7        아이
8        아이
9        아이
10    아이 아님
11    아이 아님
12    아이 아님
13    아이 아님
14    아이 아님
15    아이 아님
16    아이 아님
17    아이 아님
18    아이 아님
19    아이 아님
20    아이 아님
21    아이 아님
22    아이 아님
23    아이 아님
24    아이 아님
25    아이 아님
26    아이 아님
27    아이 아님
28    아이 아님
29    아이 아님
30    아이 아님
31    아이 아님
32    아이 아님
Name: age_bin, dtype: object

- 타이타닉 데이터변형 과제
- Kaggle의 타이타닉 train 데이터 → Seaborn의 타이타닉 데이터로 변형
- 설명: who의 의미(child는 성별 상관 없이 16세 미만, man은 16세 이상 남성, woman은 16세 이상 여성)

In [87]:
import pandas as pd
import seaborn as sns
import numpy as np

In [88]:
# 답안
df_sns = sns.load_dataset('titanic')
df_sns.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [89]:
# Kaggle 데이터
df_kaggle = pd.read_csv('data/train.csv')
df_kaggle.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [90]:
df_sns.shape

(891, 15)

In [91]:
df_kaggle.shape

(891, 12)

In [92]:
df_sns.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [93]:
df_kaggle.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [94]:
df_sns.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [95]:
df_kaggle.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [96]:
# 1. class 생성: pclass가 3이면 Third / Second / First
df_kaggle['class'] = 'First'
df_kaggle.loc[df_kaggle['Pclass'] == 2, 'class'] = 'Second'
df_kaggle.loc[df_kaggle['Pclass'] == 3, 'class'] = 'Third'

In [97]:
df_kaggle['class'].value_counts()

Third     491
First     216
Second    184
Name: class, dtype: int64

In [98]:
df_sns['class'].value_counts()

Third     491
First     216
Second    184
Name: class, dtype: int64

In [99]:
# 2. who 생성: 16세 미만이면 child, 16세 이상 male -> man, 16세 이상 female -> woman (age가 널값이면 성인)
df_kaggle['who'] = 'man'
df_kaggle.loc[df_kaggle['Sex'] == 'female', 'who'] = 'woman'
df_kaggle.loc[df_kaggle['Age'] < 16, 'who'] = 'child'

In [100]:
df_kaggle['who'].value_counts()

man      537
woman    271
child     83
Name: who, dtype: int64

In [101]:
df_sns['who'].value_counts()

man      537
woman    271
child     83
Name: who, dtype: int64

In [102]:
# 3. adult_male 생성: 16세 이상 male -> True , 나머지는 False
df_kaggle['adult_male'] = False
df_kaggle.loc[(df_kaggle['Sex'] == 'male')&(df_kaggle['Age'] >= 16), 'adult_male'] = True
df_kaggle.loc[(df_kaggle['Sex'] == 'male')&(df_kaggle['Age'].isnull()), 'adult_male'] = True

In [103]:
df_kaggle['adult_male'].value_counts()

True     537
False    354
Name: adult_male, dtype: int64

In [104]:
df_sns['adult_male'].value_counts()

True     537
False    354
Name: adult_male, dtype: int64

In [105]:
# 4. deck 생성: Cabin C~~이면 deck C , Cabin 컬럼은 
df_sns['deck'].unique()

[NaN, 'C', 'E', 'G', 'D', 'A', 'B', 'F']
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [106]:
df_kaggle['Cabin'].unique()
# 슬라이싱으로 [:1]

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [107]:
df_kaggle['deck'] = df_kaggle['Cabin']
df_kaggle['deck'] = df_kaggle.loc[df_kaggle['deck'].notnull(), 'deck'].apply(lambda x: x[:1])
df_kaggle.loc[df_kaggle['deck'] == 'T', 'deck'] = np.NaN

In [108]:
df_kaggle['deck'].isnull().sum()

688

In [109]:
df_sns['deck'].isnull().sum()

688

In [110]:
df_kaggle['deck'].value_counts()

C    59
B    47
D    33
E    32
A    15
F    13
G     4
Name: deck, dtype: int64

In [111]:
df_sns['deck'].value_counts()

C    59
B    47
D    33
E    32
A    15
F    13
G     4
Name: deck, dtype: int64

In [112]:
# 5. embark_town 생성: Embarked 가 S면 Southampton
df_sns['embark_town'].value_counts()

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

In [113]:
df_kaggle['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [114]:
df_sns['embark_town'].isnull().sum()

2

In [115]:
df_kaggle['Embarked'].isnull().sum()

2

In [116]:
df_kaggle['embark_town'] = np.NaN
df_kaggle.loc[df_kaggle['Embarked'] == 'S', 'embark_town'] = 'Southampton'
df_kaggle.loc[df_kaggle['Embarked'] == 'C', 'embark_town'] = 'Cherbourg'
df_kaggle.loc[df_kaggle['Embarked'] == 'Q', 'embark_town'] = 'Queenstown'

In [117]:
df_kaggle['embark_town'].isnull().sum()

2

In [118]:
df_kaggle['embark_town'].value_counts()

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

In [119]:
df_sns['embark_town'].value_counts()

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

In [120]:
# 6. alive 생성: Survived가 0이면 no, 1이면 yes
df_kaggle['alive'] = 'no'
df_kaggle.loc[df_kaggle['Survived'] == 1, 'alive'] = 'yes'

In [121]:
df_kaggle['alive'].value_counts()

no     549
yes    342
Name: alive, dtype: int64

In [122]:
df_sns['alive'].value_counts()

no     549
yes    342
Name: alive, dtype: int64

In [123]:
# 7. alone 생성: sibsp 랑 parch 값이 둘다 0인 경우 True
df_kaggle['alone'] = False
df_kaggle.loc[(df_kaggle['SibSp'] == 0)&(df_kaggle['Parch'] == 0), 'alone'] = True

In [124]:
df_kaggle['alone'].value_counts()

True     537
False    354
Name: alone, dtype: int64

In [125]:
df_sns['alone'].value_counts()

True     537
False    354
Name: alone, dtype: int64

In [126]:
# 8. PassengerId, Name, Ticket, Cabin 컬럼 삭제
df_kaggle.drop(columns=['PassengerId', 'Name', 'Ticket', 'Cabin'], inplace=True)

In [127]:
df_kaggle.columns

Index(['Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare',
       'Embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [128]:
df_sns.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [129]:
col_lst = []
for col in df_kaggle.columns:
    col_lst.append(col.lower())

df_kaggle.columns = col_lst

In [130]:
df_kaggle.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [131]:
df_sns.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [132]:
df_kaggle.shape

(891, 15)

In [133]:
df_sns.shape

(891, 15)

In [134]:
df_kaggle.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [135]:
df_sns.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64